Revit 2024 API
BuiltInFailures.ViewSheetFailures Class
 Failures about placing viewports on sheets.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ViewSheetFailures
Visual Basic
Public NotInheritable Class ViewSheetFailures
Visual C++
public ref class ViewSheetFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures
See Also
BuiltInFailures.ViewSheetFailures Members
Autodesk.Revit.DB Namespace